# LayerId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructureLayer..::..LayerId Property
CompoundStructureLayer Class See Also
---
The id of the layer - note that this may be different from the index in the array of layers in a CompoundStructure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int LayerId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LayerId As Integer
	Get
```

Visual C++
---
```text
public:
property int LayerId {
	int get ();
}
```

# See Also
CompoundStructureLayer Class
Autodesk.Revit.DB Namespace